In [1]:
# Part 4 Maji Ndogo project: Charting the course for Maji Ndogo's water future

In [2]:
# load sql extension for magic commands
%load_ext sql

In [3]:
# connect to mysql database 
%sql mysql+pymysql://root:12345678@localhost:3306/md_water_services

Connecting to 'mysql+pymysql://root:***@localhost:3306/md_water_services'

In [8]:
%%sql
    -- select province,town,visit count, location id
SELECT
    l.province_name,
    l.town_name,
    v.visit_count,
    l.location_id
FROM
    location l
LEFT JOIN
    visits v
    ON l.location_id = V.location_id

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

60146 rows affected.

+---------------+-----------+-------------+-------------+
| province_name | town_name | visit_count | location_id |
+---------------+-----------+-------------+-------------+
|     Akatsi    |   Harare  |      1      |  AkHa00000  |
|     Akatsi    |   Harare  |      1      |  AkHa00001  |
|     Akatsi    |   Harare  |      1      |  AkHa00002  |
|     Akatsi    |   Harare  |      1      |  AkHa00003  |
|     Akatsi    |   Harare  |      1      |  AkHa00004  |
|     Akatsi    |   Harare  |      1      |  AkHa00005  |
|     Akatsi    |   Harare  |      1      |  AkHa00006  |
|     Akatsi    |   Harare  |      1      |  AkHa00007  |
|     Akatsi    |   Harare  |      1      |  AkHa00008  |
|     Akatsi    |   Harare  |      1      |  AkHa00009  |
+---------------+-----------+-------------+-------------+
Truncated to displaylimit of 10.

In [5]:
%%sql
SELECT
    *
FROM
   visits
LIMIT
    1

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

1 rows affected.

+-----------+-------------+--------------+---------------------+-------------+---------------+----------------------+
| record_id | location_id |  source_id   |    time_of_record   | visit_count | time_in_queue | assigned_employee_id |
+-----------+-------------+--------------+---------------------+-------------+---------------+----------------------+
|     0     |  SoIl32582  | SoIl32582224 | 2021-01-01 09:10:00 |      1      |       15      |          12          |
+-----------+-------------+--------------+---------------------+-------------+---------------+----------------------+

In [6]:
%%sql
SELECT
    *
FROM
   location
LIMIT
    1

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

1 rows affected.

+-------------+--------------------+---------------+-----------+---------------+
| location_id |      address       | province_name | town_name | location_type |
+-------------+--------------------+---------------+-----------+---------------+
|  AkHa00000  | 2 Addis Ababa Road |     Akatsi    |   Harare  |     Urban     |
+-------------+--------------------+---------------+-----------+---------------+

In [4]:
%sql SHOW TABLES

Running query in 'mysql+pymysql://root:***@localhost:3306/md_water_services'

12 rows affected.

+-----------------------------+
| Tables_in_md_water_services |
+-----------------------------+
|        auditor_report       |
|       data_dictionary       |
|           employee          |
|     global_water_access     |
|        incorrect_reco       |
|       incorrect_record      |
|      incorrect_records      |
|           location          |
|            visits           |
|        water_quality        |
+-----------------------------+
Truncated to displaylimit of 10.